import 'main.dart';
import 'package:flutter/material.dart';

class SecondPageM extends StatefulWidget {
  final String category;

  SecondPageM(this.category);

  @override
  State<SecondPageM> createState() => _SecondPageMState();
}

class _SecondPageMState extends State<SecondPageM> {
  final contents1 =
      "ابو اسماعیل عبد الله بن ابو منصور مست  النصاری  معروف به خواجه عبدالله انصاری و پیر هرات از مشایخ و علمای بزرگ بود .به شیخ ابو الحسن  خرقانی اخلاص و ارادت ویژه داشت ."
      "خواجه عبدالله محمد بن انصاری هروی سال ۳۸۴ -۳۹۶ هجری – در زمان سلطنت آلب ارسلان سلجوقی و وزارت خواجه نظام الملک وزیر دانشمند و دانش پرور و هنر شناس وی در یکی از دهات طوس متولد شد و در سال ۴۸۱ هجری قمری درگذشت خواجه عبدالله انصاری نابغه ایست که به شامخ ترین قلل انسانیت دست یافته و اگر نظم و نثر وی تا بدین حد دلنشین است از جادوی عشق و ایمان اوست ایمان مردی که از سر منزل طلب گذشته و هفت خوان هولناک را بدون بیم و تردید پشت سر نهاده تا به چشمه آب حیات و به کیمیای سعادت و زندگی جاویدان رسیده است."
      "وی یکی از بزرگترین کیمیاگران مشرق زمین است که قلمرو دست نیافتی او را شکوهی است که گذشت زمان در آن تاثیر نمی کند و هر سخنی از وی دنیای عظیم و پر جلالی را در پیش روی ما می گشاید و ما در این مقال نه امکان و نه فرصت و نه سودای و پایه آن را داریم که در حکمت اشراق وعرفان سخن گوئیم."
      "خواجه عبدالله انصاری از گویندگان و شعرای بسیار بلند پایه است که کلام او از دل برآمده و بر دل می نشیند و نثر وی نیز به روانی خود نوعی شعر به شمار می آید."
      "دبیات برای وی یک مقوله تجملی یا راهی برای ارتزاق و رسیدن به دولت و مکنت نیست . بلکه رازگوی اسراری است که سینه هایی سوخته و شرحه شرحه می توانند آنها را در خود بگیرند. او از این وسیله علیه غاصبین حقوق مردم نیز استفاده می کند . خواجه عبدالله انصاری عارف وارسته ای دشمن دغلکاری و نیرنگ و خود فروشی است و از بزرگترین محدثین عالم اسلام نیز شمرده می شود. به لقب شیخ الاسلام معروف بود و از نوادگان ابوایوب انصاری می باشد قدرت وی در علم و ادبیات عرب نیز بگواهی کتبی که به زبان عربی نوشته از جمله کتب : ذوالکلام و منازل السایرین برای مردی که بطور کلی هیچ مکتبی از صرف و نحو بطور کامل ندیده شگفت آور است ."
      "از آثار جاویدان این نابغه بزرگ آنچه به فارسی تصنیف شده و باقی مانده کتاب اسرار و زادالعارفین است که دنیای پر شوری از راه رسیدن به سعادت ازلی خودشناسی و خداشناسی است که عمیقاٌ باید مورد مطالعه و بررسی قرار گیرد تا اندکی به حال جذبه و شور این عارف جلیل القدر ربانی بتوان پی برد."
      "خواجه در راه طریقت پیرو شیخ ابوالحسن خرقانی بود . خواجه چون حسین بن منصور حلاج شوریده بود و این شوریدگی بیش از هر چیز در مناجات های خواجه عبداله انصاری مشهود است و آثارش مشحون از مواعظ و نصایح است و مسلک او بعدها مورد استفاده سعدی واقع گشت . گلستان و سعدی بهارستان جامی محصول همین نوع سبک است . عقاید و افکار خواجه را می توان در منازل السائرین مطالعه نمود. او حافظه ای قوی داشت و گویند سی هزار حدیث حفظ بوده است."
      "لهی یکتای بی همتائی و قیوم توانائی، بر همه چیز دانائی و بینائی و بی عیب مصفائی و از شریک مبرائی ، مسند نشین استغنائی ، چشمه الوهیت بتو زیبد ملک خدائی الهی در جلال رحمانی و در کمال رحیمی ، نه محتاج مکانی و نه آرومند زمانی ، نه کس بتو ماند و نه بکس مانی ، پیداست که در میان جانی ، بلکه جان زنده بچیزی است که تو آنی ! الهی به وجود خود قائمی و بشکر خود مشکور ، بعلم عارف نزدیکی و به جهل جاهل در افترانی الهی ترا به عظمت ستودن وسیله سروز است و بشکر نعمت تو زبان گشودن مرتبه غرور است الهی بر هر که داغ محنت خود نهادی خرمن وجودش را بباد نیستی بردادی . الیه هر که ترا شناخت هر چه غیر از تو بود بینداخت ."
      "الهی چون در تو نگرم از جمله تاج دارانم و چون در خود نگرم از جمله خاکسارانم خاک بر باد کردم و بر تن خود بیداد کردم و شیطان را شاد الهی در سر خمار تو دارم و در دل اسرار تو دارم و بر زبان اشعار تو الهی اگر گویم ستایش و ثنای تو گویم و اگر جویم رضای تو جویم الهی اگر طاعت بسی ندارم اندر دو جهان جز تو کسی ندارم .";
  final contents2 =
      "اکثر شما حداقل یکبار در طول زندگی تان توفیق زیارت حرم مطهر علی بن موسی الرضا (علیه‌السلام) را داشته اید و مسجد متبرک گوهرشاد را که واقع در صحن و سرای حرم اما رضا (علیه‌السلام) است دیده اید ولی آیا می دانید پایه گذار احداث این بنای زیبا بانویی شیعه، ادب دوست و هنرپرور و خیر بنام گوهرشاد بیگم همسر شاهرخ میرزای تیموری است؟ در این مطلب به معرفی زندگی با برکت این بانوی مسلمان شیعه می پردازیم:"
      "گوهرشاد بیگم دختر امیر غیاث الدین ترخان است که یکی از امرای عهد تیموری بوده و در جنگ های بزرگی شرکت داشته و چنگیزخان او را «ترخان» کرده بود. ترخان یا آغاجی یا آغجی، عنوان منصب خاصی در دستگاه اُمرای ماوراءالنهر و خراسان بوده است که صاحب این منصب، واسطه میان سلطان و رعیت بوده است. مادر گوهرشاد بیگم بانو خان زاده بیگم است که در ماه رجب سال 814 هـ.ق وفات کرده و در جوار مرقد مطهر امام رضا (علیه‌السلام) مدفون گردیده است."
      "گوهرشاد در سال 780 هـ.ق دیده به جهان گشود؛ او از زمره زنان ادب دوست، هنرپرور و خیّر در زمان خویش بود. به تاریخ و ادبیات علاقمند بود و به دلیل تمکن مالی و انصاف بسیار خیّر و نیکوکار بود. همسر او شاهرخ میرزای تیموری بود که در چهاردهم ربیع الثانی سال 779 هـ.ق متولد و در سال 850 هـ.ق درگذشت و جنازه اش را به هرات حمل نمودند و در مدرسه گوهرشاد آغا دفن گردید. سلطنت شاهرخ 43 سال بوده است. از آن روی که گوهرشاد دوستدار لقب بود، مهری هروی شاعره نامدار قرن نهم را مصاحب و ندیمه خود ساخت. وی علاوه بر همسر، مشاور و همدم شاهرخ میرزا نیز بود و در بسیاری از تصمیمات مهم کشوری شاهرخ از وجود وی بهره می برد."
      "گوهرشاد ؛ پرورش دهنده دو فرزند هنرمند"
      "این بانوی محترمه دارای دو پسر بوده است: یکی به نام میرزا ابراهیم یا ابراهیم سلطان که در ماه شوال 796 هـ.ق متولد و در ماه شوال سال 837 هـ.ق وفات یافت و پسر دیگر وی به نام میرزا بایسُنقُر بود که در سال 802 هـ.ق متولد و در سال 837 هـ.ق درگذشت. هر دو پسر گوهرشاد بیگم؛ هنرمند در زمینه خط و دیگر کمالات ممتاز بوده اند. میرزا بایسنقر خوش طبع و هنرپرور بود و در خط ثلث سرآمد دیگر خطاطان زمان خویش بود کتیبه پیش طاق مسجد گوهرشاد به خط ثلث از هنرهای بایسنقر است که به دست خود او نگاشته شده است. همچنین بزرگترین قرآن موجود که طول هر صفحه آن دو زرع و نیم است از جمله آثار ارزنده اوست که هم اکنون برخی صفحات آن در آستان قدس رضوی و کتابخانه آقای علی اصغر مهدوی در تهران موجود است. میرزا بایسنقر دوستدار و بانی زیباترین مکتب کتابسازی در ایران بوده است و در زمان خویش نسخه های نفیس و زیبا بسیار نوشته و به تصویر کشیده است. همچنین به جهت علاقه خاصی که به هنر نشان می داد هنرمندان بسیاری را حمایت می کرد و گرد هم می آورد. میرزا ابراهیم هم مانند برادرش؛ فاضل و هنرمند بود و هم اکنون قرآنی به خط نسخ بسیار عالی از وی در موزۀ کتابخانه آستان قدس رضوی موجود است. و کتبیه های بسیاری به خط میرزا ابراهیم در شیراز وجود دارد که از جمله دارالصفا و دارالأیتام و کتبیه موجود در عمارت بقعه ظهیری است. همچنین میرزا ابراهیم با رنج بسیاری کلیه مصالح و زندگی تیمور را به فارسی و ترک جمع آوری و مقایسه و تدوین کرد و تحویل شرف الدین علی یزدی داد"
      "اقدامات گوهرشاد بیگم"
      "گوهرشاد بیگم آثار و ابنیه زیادی از خود بر جای گذاشت که می توان از مسجد جامع، مدرسه و خانقاه شهر هرات و مسجدی نیز در جنب مرقد امام رضا (علیه‌السلام) نام برد. که این دو مسجد به نام خود وی به مسجد گوهرشاد معروفند و از شاهکارهای هنر و معماری و کاشیکاری قرن نهم هجری به شمار می رود. همچنین آثار ارزنده ای در حرم امام رضا (علیه‌السلام) و اطراف آن پدید آورد. از جمله دو رواق «دارالحفاظ» و «دارالسیاده» را بنا کرد که معمار این دو رواق و دو مسجد در هرات و مشهد قوام الدین شیرازی بود."
      "مدرسه و خانقاهی که گوهرشاد دستور احداث آن را صادر کرد محلی بود برای تحصیل علمای برجسته ای چون مسعود شروانی، متوفی به سال 905 هـ.ق که از بزرگترین علمای خراسان و همچنین خواجه عبدالرحمن اوحد بود. آغاز احداث بنای این مدرسه کم نظیر در سال 820 هـ.ق بوده است که در کنار آن کتابخانه و بیمارستان توسط گروهی از معماران برجسته به ریاست استاد قوام الدین شیرازی احداث شده است و خطاطان معروفی همچون جعفر جلال هروی خطوط کتیبه های آن را تذهیب و تزئین نموده اند.";
  final contents3 =
      "سلمان هراتی در سال ۱۳۳۸ در روستای مرزدشت تنکابن مازندران در خانواده‌ای مذهبی متولد شد. درس‌های ابتدایی تا پایان دوران متوسطه را در زادگاهش خواند. سپس در دانشسرای راهنمایی تحصیلی پذیرفته شد و پس از دو سال در رشتهٔ هنر، مدرک فوق دیپلم اخذ کرد. وی پس از پایان تحصیلات در یکی از مدارس روستاهای دور لنگرود مشغول تدریس شد."
      "خلص او در اشعارش «آذرباد» بود و در شعرهایش میتوانیم تاثیر از سهراب سپهری و فروغ فرخزاد را نگاه کنیم او حتی یکی از شعرهایش را تقدیم به سهراب سپهری کرده بود دوستی او با سیدحسن حسینی و قیصر امین‌پور زبانزد است ، سیدحسن حسینی بعد از مرگ سلمان یکی از بهترین آثار ادبیش یعنی کتاب “بیدل ، سپهری و سبک هندی” را تقدیم به او کرد و قیصر امین پور هم کلیات او را منتشر کرد. سلمان هراتی به عنوان شاعری دگراندیش به حساب میآید."
      "ویژگی های شعر سلمان"
      "سلمان هراتی از شاعارن بنام عصر انقلاب است که زبان و اندیشه و دیدگاه نوینی در اشعارش جلوه گر است شعر سلمان با تصاویر بدیع از طبیعت و حالات درونی انسان  ارتباط با خدا ، ویژگی خاص و لحن مختص به خود است ."
      "زبان شعر او صمیمی و ساده است او تمام صداقت و صمیمیت خود را در قالب شعر هایش میریخت .شعر او در عین ارتباط داشتن تنگاتنگ با طبیعت و راز و نیاز با خدا دارای مضمونی اجتماعی و پر شور است ."
      "شعر سلمان از نظر لحن و بیان تصاویر طبیعت و زندگی و سادگی گفتار ، شباهت هایی با شعر سهراب دارد ، سلمان در ثالبهای گوناگون شعر سروده است اما بیشترین سروده های او در قالب شعر منثور – شعر سپید – است ۰"
      "خواننده شعرهای سلمان هراتی، در وهله نخست بیش از هر چیز با ایدئولوژی شاعر مواجه می شود. بیشتر اشعار سلمان، مستقیم یا غیر مستقیم به بازگویی جهان بینی، اعتقادات و برداشت های اجتماعی و سیاسی او می پردازد. سلمان هراتی شعر را برای ادای تعهد اجتماعی و حتی گاه سیاسی خود می داند. آنجا که سلمان از وطن می گوید، منظورش ایران معاصر است و در وصف آن، نه به تاریخ سرک می کشد و نه مختصات فرهنگ ملی را برجسته می کند، بلکه از ایرانی سخن می گوید که نام خیابان هایش را شهیدان برگزیده اند، بهشت زهرایی دارد که آبروی زمین است، میزبان حضرت امام رحمه الله بوده و به واسطه جنگ، چندین تابستان است که در خون و آفتاب می رقصد.";
  final contents4 =
      ".او در سال ۱۳۰۸ خورشیدی در شهر کهنه هرات به دنیا آمد. به حیث کارمند دولت در هرات و دیگر ولایات افغانستان خدمت کرد، با حضور شوروی و آغاز جنگ‌ها، در دهه شصت خورشیدی به ایران مهاجرت کرد، پس از پیروزی مجاهدین در سال ۱۳۷۱ به زادگاه خود هرات برگشت و بیش از دو دهه آخر عمر خود را در هرات گذراند"
      " شاعری غزل‌سرا با جانمایه‌های نوتر و متکی بر روال کلاسیک شعر فارسی بود. از او شعرهای بسیاری منتشر شده و دیوانی از او به کوشش آصف رحمانی پارسی در هزار نسخه سال ۱۳۹۷ درهرات منتشر شده است."
      "او از شاعران اثر گذار در جریان شعر نیم قرن اخیر و به ویژه شعر مهاجرت افغانستان بود، جریانی که پس از حضور شوروی و مهاجرت مردم افغانستان، در ایران و عمدتا در شهر مشهد، خراسان رضوی امروز شکل گرفت"
      "او کهن‌سال‌ترین در میان طیف شاعر و اهل قلم به ویژه در غرب افغانستان بود. بسیاری از اهل ادبیات و خاصه شعر و آنانی که در مهاجرت نیم قرنه مردم افغانستان در ایران، قدم به عرصه شعر گذاشته‌اند، به نوعی خود را وام‌دار حلقه نخستین شاعران مهاجر افغانستان و تلاش‌های آقای فدایی می‌دانند و به قولی او را شخصیتیشاعرپرور می‌نامند، سخنی که با توجه به ایجاد، دوام و اثرگذاری حلقات شعر و ادبیات در محوریت او‌، به ویژه در سال‌های نخستین مهاجرت، سخن دقیقی نیز می‌تواند باشد.";
  final contents5 =
      "وقتی به تاریخ تجارت افغانستان نظر می اندازیم، در میابیم که افغانستان همیشه سرزمین جنگ و جدل نبوده است. ما باید به تاریخ بازرگانی این سرزمین بیشتر پی ببریم تا برای نسل های امروز و فردا روشن بسازیم که افغان ها همیشه از دست رنج و تلاش های خویش برای بهبود زندگی شان بهره می گرفتند و هیچ زمانی مانند امروز منتظر کمک های جهان نبوده اند. اگر چه افغانستان کشور زراعتی به حساب می آید اما تجارت نیز از دیر زمان در این سرزمین رونق داشته است. یکی از مناطق مهم افغانستان که درتجارت وپیشه وری زبان زد است، ولایت هرات است. هرات از مکان های تاریخی افغانستان است که هم به لحاظ فرهنگی و هم اقتصادی از جایگاه ویژه ای برخوردار است. راه ابریشم به عنوان خط تاریخی تجارت از گذشته های دور، هرات را به نقطه وصل تجارت بین کشورهای جهان، (از چین تا هند، تا کشورهای خاورمیانه و سرزمین های اروپایی) تبدیل ساخته بود. در دوره معاصر نیز هرات به عنوان پایتخت اقتصادی افغانستان، تجارت پیشه گان و صنعت کاران شناخته شده ای را در دل خود پرورش داد که توانستند گام های محکم و بلندی را در راه تجارت و صنعت افغانستان بردارند. یکی از این تاجران، محمد امین خان است که از دارای اوصاف ملی و میهنی بود. ایشان از پیش گامان تجارت افغانستان به حساب می رود که در حیات خود توانست تجارت، صنعت و بانکداری را در کشور رونق دهد و عمر خویش رادر این راه وقف نماید."
      "محمد امین خان فرزند محمد رحیم خان در سال ۱۲۶۷ خورشیدی در ولایت هرات دیده به جهان گشود. دوران کودکی را در نزد پدر به تجارت سپری کرد و بعد ها در دوران جوانی راه پدر را به درستی ادامه داد و تجارت پیشه شد. او عاشق شغل خویش بود و در راه آبادی و شکوفایی کشورش تلاش می ورزید. او از اعضای برجسته و مهم بانکداری در افغانستان شمرده می شود که در تاسیس بانک ملی به همراه عبدالمجید خان زابلی سهم فعال داشت. قابل یاد اوری است که محمد امین خان از موسسین بانک نساجی و از سهام داران بزرگ این شرکت بوده است. ایشان در خارج از کشور نیز روابط تجاری گسترده ای داشت و از تاجران تاثیر گذار در رشد فرهنگ بانکداری در افغانستان بود. بانک افغانستان از جمله بانک هایی بود که در پاکستان تاسیس شد و ایشان آن را مدیرت میکرد."
      "بر می گردم به زندگی محمد امین خان، گفته می شود زمانی که محمد رحیم خان پدر محمد امین خان توسط دزدان جان خود را از دست می دهد؛ تمامی مسئولیت های زندگی و تجارت پدر به پسرش می رسد و محمد امین خان با متانت و بردباری، جوان خویش را با انبوهی از مسئولیت های سنگین آغاز می کند و تجارت پدر را گسترش می دهد. جوانی آگاه و توانمند که توانست به صورت درست از میراث پدر استفاده کند."
      "محمد امین خان با تمام وجود راه پدر را ادامه داد. او جوانی خوش سیما، خوش اخلاق، وطن دوست، مومن و صوفی مشرب بود که به افغانستان می اندیشید و کمر همت را در راه آبادی وطن بسته بود و کارهای عظیمی را در زندگی اش به پایه اکمال رساند. محمد امین خان از تاجران خوش نام، ملی و در عین حال زحمت کش و صادق کشور بود که توانست به مدت کم کارهای بزرگی را انجام دهد و به ملکیت های زیادی دست پیدا کند";
  final contents6 =
      "رودکی، ‌ابوعبدالله جعفر فرزند محمد فرزند حکیم فرزند عبدالرحمان فرزند آدم. از کودکی و چگونگی تحصیل او آگاهی چندانی به دست نیست. در ۸ سالگی قرآن آموخت و آن را از بر کرد و از همان هنگام به شاعری پرداخت."
      " برخی می گویند در مدرسه های سمرقند درس خوانده است. آنچه آشکار است، وی شاعری دانش آموخته بود و تسلط او بر واژگان فارسی چندان است که هر فرهنگ نامه ای از شعر او گواه می آورد"
      "رودکی از روزگار جوانی آوازی خوش داشت، در موسیقی و نوازندگی چیره دست و پر آوازه بود. وی نزد ابوالعنک بختیاری موسیقی آموخت و همواره مورد ستایش او بود، آن چنان که استاد در روزگار کهنسالی چنگ خود را به رودکی بخشید. رودکی در همان دوره شعر نیز می سرود. شعر و موسیقی در سده های چهارم و پنجم همچون روزگار پیش از اسلام به هم پیوسته بودند و شعر به همراه موسیقی خوانده می شد. شاعران بزرگ آنانی بودند که موسیقی نیز می دانستند."
      "از هم عصران رودکی ،منجیک ترمذی (نیمه دوم سده چهارم) و پس از او فرخی (۴۲۹ ق) استاد موسیقی زمانه خویش بودند. شاعران، معمولاً قصیده هایشان را با ساز و در یکی از پرده های موسیقی می خواندند. هرکس که صدایی خوش نداشت یا موسیقی نمی دانست، از راوی می خواست تا شعرش را در حضور ممدوح بخواند. رودکی، شعرش را با ساز می خواند ."
      "رفته رفته آوازه رودکی به دربار سامانیان رسید و نصربن احمد سامانی (۳۰۱ ـ ۳۳۱ ق) او را به دربارفرا خواند. برخی بر این گمانند که او پیش از نصربن احمد به دربار سامانیان رفته بود، در آنجا بزرگترین شاعر دربار سامانی شد. در آن روزگار در محیط ادبی، علمی، اقتصادی و اجتماعی فرارود، آن چنان تحولی شگرف روی داده بود که دانش پژوهان، آن دوره را دوران نوزایی (رسانس) ایرانی می نامند."
      "بر بستر چنین زمینه مناسب اقتصادی، اجتماعی و برپایه دانش دوستی برخی از پادشاهان سامانی، همچنین با تلاش و خردمندی وزیرانی دانشمند و کاردان چون ابوالفضل بلعمی (۳۳۰ ق) و ابوعلی محمد جیهانی (۳۳۳ ق)، بخارا به صورت مرکز بزرگ علمی، ادبی و فرهنگی درآمد. دربار سامانیان، محیط گرم بحث و برخورد اندیشه شد و شاعران و فرهنگمداران از راههای دور و نزدیک به آنجا روی می آوردند";

  @override
  Widget build(BuildContext context) {
    return Scaffold(
      appBar: AppBar(
        title: Text(widget.category),
      ),
      body: Container(
        decoration: BoxDecoration(
          image: DecorationImage(
            image: AssetImage("assets/images/A1.jpg"),
            fit: BoxFit.cover,
          ),
        ),
        child: Padding(
          padding: const EdgeInsets.all(120),
          child: ListView(
            children: [
              ListTile(
                leading: CircleAvatar(
                  backgroundImage: AssetImage('assets/images/A1.jpg'),
                ),
                title: Text(
                  'خواجه عبدلله انصاری',
                ),
                onTap: () {
                  Navigator.push(
                    context,
                    MaterialPageRoute(
                        builder: (context) => ThirdPage(contents1)),
                  );
                },
              ),
              ListTile(
                leading: CircleAvatar(
                  backgroundImage: AssetImage('assets/images/q1.jpg'),
                ),
                title: Text('ملکه گوهر شاد بیگم'),
                onTap: () {
                  Navigator.push(
                    context,
                    MaterialPageRoute(
                        builder: (context) => ThirdPage(contents2)),
                  );
                },
              ),
              ListTile(
                leading: CircleAvatar(
                  backgroundImage: AssetImage('assets/images/download۵۵.jpg'),
                ),
                title: Text(' زندگی نامه سلمان هراتی شاعر معاصر '),
                onTap: () {
                  Navigator.push(
                    context,
                    MaterialPageRoute(
                        builder: (context) => ThirdPage(contents3)),
                  );
                },
              ),
              ListTile(
                leading: CircleAvatar(
                  backgroundImage: AssetImage('assets/images/۱۲۳۳۴.jpg'),
                ),
                title: Text('فدایی هروی'),
                onTap: () {
                  Navigator.push(
                    context,
                    MaterialPageRoute(
                        builder: (context) => ThirdPage(contents4)),
                  );
                },
              ),
              ListTile(
                leading: CircleAvatar(
                  backgroundImage: AssetImage('assets/images/8582.jpg'),
                ),
                title: Text('	خلاصه زندگی نامه رودکی'),
                onTap: () {
                  Navigator.push(
                    context,
                    MaterialPageRoute(
                        builder: (context) => ThirdPage(contents6)),
                  );
                },
              ),
              ListTile(
                leading: CircleAvatar(
                  backgroundImage:
                      AssetImage('assets/images/محمد امین خان به قلم مبین.png'),
                ),
                title: Text('  محمد امین خان تاجر'),
                onTap: () {
                  Navigator.push(
                    context,
                    MaterialPageRoute(
                        builder: (context) => ThirdPage(contents5)),
                  );
                },
              ),
            ],
          ),
        ),
      ),
    );
  }
}
